cas-server-support-saml_src_test_java_org_jasig_cas_support_saml_authentication_principal_SamlServiceTests.java/[CN]/SamlServiceTests/[MT]/verifyRequestBody()/body

{
  final String body="<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">" + "<SOAP-ENV:Header/><SOAP-ENV:Body><samlp:Request xmlns:samlp=\"urn:oasis:names:tc:SAML:1.0:protocol\" MajorVersion=\"1\" " + "MinorVersion=\"1\" RequestID=\"_192.168.16.51.1024506224022\" IssueInstant=\"2002-06-19T17:03:44.022Z\">"+ "<samlp:AssertionArtifact>artifact</samlp:AssertionArtifact></samlp:Request></SOAP-ENV:Body></SOAP-ENV:Envelope>";
  final MockHttpServletRequest request=new MockHttpServletRequest();
  request.setContent(body.getBytes());
  final SamlService impl=new SamlServiceFactory().createService(request);
  assertEquals("artifact",impl.getArtifactId());
  assertEquals("_192.168.16.51.1024506224022",impl.getRequestID());
}
